docs(readme): fix machine-readable HTML comment header tag
